# Ex3 - Getting and Knowing your Dataexercises

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [11]:
dset = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",sep='|')
dset

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [15]:
user = pd.DataFrame(dset, index=dset['user_id'])
user
user.index[0]

1

### Step 4. See the first 25 entries

In [16]:
user.head(25)

         user_id   age gender     occupation zip_code
user_id
1            2.0  53.0      F          other    94043
2            3.0  23.0      M         writer    32067
3            4.0  24.0      M     technician    43537
4            5.0  33.0      F          other    15213
5            6.0  42.0      M      executive    98101
6            7.0  57.0      M  administrator    91344
7            8.0  36.0      M  administrator    05201
8            9.0  29.0      M        student    01002
9           10.0  53.0      M         lawyer    90703
10          11.0  39.0      F          other    30329
11          12.0  28.0      F          other    06405
12          13.0  47.0      M       educator    29206
13          14.0  45.0      M      scientist    55106
14          15.0  49.0      F       educator    97301
15          16.0  21.0      M  entertainment    10309
16          17.0  30.0      M     programmer    06355
17          18.0  35.0      F          other    37212
18          19.0  40.0      M      librarian    02138
19          20.0  42.0      F      homemaker    95660
20          21.0  26.0      M         writer    30068
21          22.0  25.0      M         writer    40206
22          23.0  30.0      F         artist    48197
23          24.0  21.0      F         artist    94533
24          25.0  39.0      M       engineer    55107
25          26.0  49.0      M       engineer    21044

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [18]:
user.tail(10)

         user_id   age gender     occupation zip_code
user_id
934        935.0  42.0      M         doctor    66221
935        936.0  24.0      M          other    32789
936        937.0  48.0      M       educator    98072
937        938.0  38.0      F     technician    55038
938        939.0  26.0      F        student    33319
939        940.0  32.0      M  administrator    02215
940        941.0  20.0      M        student    97229
941        942.0  48.0      F      librarian    78209
942        943.0  22.0      M        student    77841
943          NaN   NaN    NaN            NaN      NaN

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [19]:
user.shape[0]

943

943

In [21]:
user.shape[1]

5

### Step 7. What is the number of columns in the dataset?

In [20]:
user.shape[1]

5

In [22]:
user.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 8. Print the name of all the columns.

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [23]:
user.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 9. How is the dataset indexed?

In [46]:
# "the index" (aka "the labels")

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [24]:
user.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     942 non-null    float64
 1   age         942 non-null    float64
 2   gender      942 non-null    object
 3   occupation  942 non-null    object
 4   zip_code    942 non-null    object
dtypes: float64(2), object(3)
memory usage: 84.2+ KB

In [39]:
user.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [34]:
type(user.columns)

pandas.core.indexes.base.Index

### Step 10. What is the data type of each column?

In [40]:
user['occupation']

user_id
1              other
2             writer
3         technician
4              other
5          executive
           ...
939    administrator
940          student
941        librarian
942          student
943              NaN
Name: occupation, Length: 943, dtype: object

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [49]:
a = len(user.groupby('occupation'). user_id.count())
a

21

user_id
1         technician
2              other
3             writer
4         technician
5              other
6          executive
7      administrator
8      administrator
9            student
10            lawyer
11             other
12             other
13          educator
14         scientist
15          educator
16     entertainment
17        programmer
18             other
19         librarian
20         homemaker
21            writer
22            writer
23            artist
24            artist
25          engineer
26          engineer
27         librarian
28            writer
29        programmer
30           student
           ...
914            other
915    entertainment
916         engineer
917          student
918        scientist
919            other
920           artist
921          student
922    administrator
923          student
924            other
925         salesman
926    entertainment
927       programmer
928          student
929        scientist
930        scientist
931         educator
932         educator
933          student
934         engineer
935           doctor
936            other
937         educator
938       technician
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [76]:
a = user.groupby('occupation').count().sort_values(['user_id'],ascending=False)
a
a.head(1)

            user_id  age  gender  zip_code
occupation
student         196  196     196       196

In [69]:
 #user.groupby('occupation'). user_id.count().max()
a = user.groupby('occupation').count().sort_values(['user_id'],ascending=False)
a.head(1)

            user_id  age  gender  zip_code
occupation
student         196  196     196       196

21

In [77]:
user.describe()

          user_id         age
count  942.000000  942.000000
mean   472.500000   34.062633
std    272.076276   12.194810
min      2.000000    7.000000
25%    237.250000   25.000000
50%    472.500000   31.000000
75%    707.750000   43.000000
max    943.000000   73.000000

### Step 13. What is the most frequent occupation?

### Step 14. Summarize the DataFrame.

'student'

In [70]:
user.describe()

          user_id         age
count  942.000000  942.000000
mean   472.500000   34.062633
std    272.076276   12.194810
min      2.000000    7.000000
25%    237.250000   25.000000
50%    472.500000   31.000000
75%    707.750000   43.000000
max    943.000000   73.000000

In [78]:
user.occupation.describe()

count         942
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 15. Summarize all the columns

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [79]:
user.age.mean()

34.06263269639066

### Step 16. Summarize only the occupation column

### Step 17. What is the mean age of users?

In [92]:
a = user.groupby('age').count().sort_values(['user_id'],ascending=True)
a

      user_id  gender  occupation  zip_code
age
7.0         1       1           1         1
66.0        1       1           1         1
73.0        1       1           1         1
10.0        1       1           1         1
11.0        1       1           1         1
...       ...     ...         ...       ...
27.0       35      35          35        35
28.0       36      36          36        36
22.0       37      37          37        37
25.0       38      38          38        38
30.0       39      39          39        39

[61 rows x 4 columns]

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

34

### Step 18. What is the age with least occurrence?

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64